       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      **************************************
      * AREA DE COMENTARIOS
      * AUTHOR: GUSTAVO ANTUNES
      * OBJETIVO: MOSTRAR A STRING HELLO WORLD
      * DATA: 27/12/2019
      *************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
