       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB10.
      **************************************
      * AREA DE COMENTARIOS
      * AUTHOR: GUSTAVO ANTUNES
      * OBJETIVO: CALCULAR AUMENTO SALARIAL POR TEMPO DE CASA
      * ESTRUTURANDO EM PARAGRAFOS
      * DATA: 30/12/2019
      *************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME        PIC X(20)     VALUE SPACES.
       77 WRK-ANO-ENTRADA PIC 9(04)     VALUES ZEROS.
       77 WRK-SALARIO     PIC 9(05)V99  VALUES ZEROS.
       01 WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.
       77 WRK-AUMENTO     PIC 9(05)V99  VALUES ZEROS.
       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           PERFORM 0200-PROCESSAR.
           PERFORM 0300-FINALIZAR.
           STOP RUN.
       0100-INICIALIZAR.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.

           DISPLAY 'NOME.. '.
           ACCEPT WRK-NOME FROM CONSOLE.

           DISPLAY 'SALARIO.. '.
           ACCEPT WRK-SALARIO FROM CONSOLE.

           DISPLAY 'ANO ENTRADA.. '.
           ACCEPT WRK-ANO-ENTRADA FROM CONSOLE.

           SUBTRACT WRK-ANO-ENTRADA FROM WRK-ANO GIVING WRK-ANO-ENTRADA.
       0200-PROCESSAR.
           EVALUATE WRK-ANO-ENTRADA
               WHEN 2 THRU 5
                   MULTIPLY WRK-SALARIO BY 0,05 GIVING WRK-AUMENTO
               WHEN 6 THRU 15
                   MULTIPLY WRK-SALARIO BY 0,10 GIVING WRK-AUMENTO
               WHEN GREATER THAN 15
                   MULTIPLY WRK-SALARIO BY 0,15 GIVING WRK-AUMENTO
           END-EVALUATE.
       0300-FINALIZAR.
           DISPLAY 'AUMENTO... ' WRK-AUMENTO.
